app/controllers/three_d_files_controller.rb

   def index
      @ThreeDFiles = ThreeDFile.all
---
SELECT "three_d_files".* FROM "three_d_files"

   def create
      @ThreeDFile = ThreeDFile.new(threedfile_params)

      if @ThreeDFile.save
---
INSERT INTO "three_d_files" ("name", "attachment", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "mymodel"], ["attachment", "BlackWater-Lightversion.stl"], ["created_at", "2022-10-16 17:07:06.837063"], ["updated_at", "2022-10-16 17:07:06.837063"]]

   def destroy
      @ThreeDFile = ThreeDFile.find(params[:id])
      @ThreeDFile.destroy
---
SELECT  "three_d_files".* FROM "three_d_files" WHERE "three_d_files"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
DELETE FROM "three_d_files" WHERE "three_d_files"."id" = ?  [["id", 14]]

  def show
  	 @ThreeDFile = ThreeDFile.find(params[:id])
---
SELECT  "three_d_files".* FROM "three_d_files" WHERE "three_d_files"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]